//1. 常用格式
/**
  * ......
  * 大量批注, 解释后面的代码
  * ......
  */

/// 单行批注, 解释后面的代码

///< 单行批注, 解释前面的代码

//2. 其它格式
/*！
  * ......
  * 大量批注, 解释后面的代码
  * ......
  */

//! 单行批注, 解释后面的代码

/**< 单行批注, 解释前面的代码 */

/*!< 单行批注, 解释前面的代码 */

//!< 单行批注, 解释前面的代码

//3.@指令举例
/**
  * @brief  简要说明
  */

/**
  * @note   要点说明
  */



/**
  * @defgroup 组名称
  * 定义一个组,内容包含开始
  * @{
  */

/**
  * @}
  * 内容包含结束
  */



/** @addtogroup Doxygen_Demo
  * 加入到一个组,内容包含开始
  * @{
  */

/**
  * @}
  * 内容包含结束
  */
