/**
  ******************************************************************************
  * @file    doxygen_demo.c
  * @author  mousie
  * @version V1.0.0
  * @date    2010.3.24
  * @brief   使用doxygen格式的c文件注释示例, 可作为软件注释的标准模板
  *          使用doxygen可以快速生成规范的软件说明文档.
  *          更多关于doxygen的信息请自行搜索查阅.
  *
  *          C语言编程规范使用linux风格.
  *
  *          版本记录使用如下格式:
  * -V1.0.1, 2010.3.25, mousie
  *          - 改动1
  *          - 改动2
  * -V1.0.0, 2010.3.24, mousie
  *          - 改动1
  *          - 改动2
  ******************************************************************************
  */

/* Include -------------------------------------------------------------------*/
#include "doxygen_demo.h"



/** @addtogroup Drivers
  * @{
  */
/** @defgroup Doxygen_Demo
  * @{
  */



/**
  ******************************************************************************
  * @addtogroup Doxygen_Demo_Configure
  ******************************************************************************
  * @{
  */

/**
  * @}
  */

/** @defgroup Doxygen_Demo_Private_TypeDefine
  * @brief    私有类型定义
  * @{
  */



/**
  * @}
  */

/** @defgroup Doxygen_Demo_Private_MacroDefine
  * @brief    私有宏定义
  * @{
  */

/**
  * @}
  */

/** @defgroup Doxygen_Demo_Variables
  * @brief    定义全局变量(私有/公有)
  * @{
  */

/**
  * @}
  */

/** @defgroup Doxygen_Demo_Private_Function
  * @brief    定义私有函数
  * @{
  */

/**
  * @}
  */



/** @defgroup Doxygen_Demo_Function
  * @brief    函数原文件
  * @{
  */

/**
  ******************************************************************************
  * @brief  函数简要描述
  * @param  输入参数1, 参数1描述
  *   @arg  ENABLE,    使能
  *   @arg  DISABLE,   禁止
  * @note   特别说明,  可略, 仅加在必要的地方.
  * @param  输入参数2, 参数2描述
  * @retval none/value, 返回值描述
  ******************************************************************************
  */
void function(void)
{
}

/**
  * @}
  */



/**
  * @}
  */
/**
  * @}
  */

/* END OF FILE ---------------------------------------------------------------*/
